# Origin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..Origin Property
DimensionSegment Class See Also
---
The segment origin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# Remarks
The origin will be the midpoint of the line that makes up the segment.
# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace